"use strict";
//збільшення на одиницю

//! Префіксний інкремент спочатку збільшує значення змінної, а потім використовує нове значення у виразі.
// let x = 5;
// const y = ++x;
// console.log(x); // 6
// console.log(y); // 6

//! Постфіксний інкремент спочатку використовує поточне значення змінної у виразі, а потім виконує збільшення значення.
// let x = 5;
// const y = x++;
// console.log(x); // 6
// console.log(y); // 5

//! Префіксний декремент спочатку зменшує значення змінної, а потім використовує нове значення у виразі.
// let x = 5;
// const y = --x;
// console.log(x); // 4
// console.log(y); // 4

//! Постфіксний декремент спочатку використовує поточне значення змінної у виразі, а потім виконує зменшення значення.
// let x = 5;
// const y = x--;
// console.log(x); // 4
// console.log(y); // 5

for (let i = 0; i <= 5; i++) {
  console.log(i);
}
